brew "python@3.12"
brew "virtualenv"
brew "node@24"
brew "docker"

brew "nmap"
brew "nikto"
brew "nuclei"
brew "sqlmap"
brew "gobuster"
brew "graphql-inspector"
brew "naabu"
brew "amass"
brew "subfinder"
brew "ffuf"
brew "feroxbuster"
brew "arjun"
brew "httpx"
brew "katana"
brew "theharvester"
brew "masscan"
brew "arp-scan"
brew "ike-scan"
brew "socat"
brew "sslscan"
cask "metasploit"
brew "john"
brew "hydra"
brew "ncrack"
brew "iproute2" if OS.linux?
brew "net-tools" if OS.linux?
brew "netcat"
brew "curl"
brew "tcpdump"
brew "gdb"
brew "strace" if OS.linux?
brew "radare2"
brew "binwalk"
brew "foremost"
brew "hashcat"
brew "dalfox"
brew "trufflehog"
